<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>PayloadContent</key>
  <array>
    <!-- SCEP payload for MDM identity certificate -->
    <dict>
      <key>PayloadContent</key>
      <dict>
        <key>Challenge</key>
        <string>micromdm</string>
        <key>Key Type</key>
        <string>RSA</string>
        <key>Key Usage</key>
        <integer>5</integer>
        <key>Keysize</key>
        <integer>2048</integer>
        <key>Name</key>
        <string>Device Management Identity Certificate</string>
        <key>Subject</key>
        <array>
          <array>
            <array>
              <string>O</string>
              <string>MicroMDM</string>
            </array>
          </array>
          <array>
            <array>
              <string>CN</string>
              <string>MicroMDM Identity (%ComputerName%)</string>
            </array>
          </array>
        </array>
        <key>URL</key>
        <string>https://inference-test.openinnovation.dev/scep</string>
      </dict>
      <key>PayloadDescription</key>
      <string>Configures SCEP</string>
      <key>PayloadDisplayName</key>
      <string>SCEP</string>
      <key>PayloadIdentifier</key>
      <string>com.github.micromdm.micromdm.enroll.scep</string>
      <key>PayloadOrganization</key>
      <string>DGInf</string>
      <key>PayloadType</key>
      <string>com.apple.security.scep</string>
      <key>PayloadUUID</key>
      <string>D01D95F9-762E-4538-A9B3-4D949D55577C</string>
      <key>PayloadVersion</key>
      <integer>1</integer>
    </dict>
    <!-- MDM payload -->
    <dict>
      <key>AccessRights</key>
      <integer>1041</integer>
      <key>CheckInURL</key>
      <string>https://inference-test.openinnovation.dev/mdm/checkin</string>
      <key>CheckOutWhenRemoved</key>
      <true/>
      <key>IdentityCertificateUUID</key>
      <string>D01D95F9-762E-4538-A9B3-4D949D55577C</string>
      <key>PayloadDescription</key>
      <string>Enrolls with the MDM server</string>
      <key>PayloadIdentifier</key>
      <string>com.github.micromdm.micromdm.enroll.mdm</string>
      <key>PayloadOrganization</key>
      <string>DGInf</string>
      <key>PayloadType</key>
      <string>com.apple.mdm</string>
      <key>PayloadUUID</key>
      <string>4DF05DBF-6D20-41A4-8072-A51D327258E7</string>
      <key>PayloadVersion</key>
      <integer>1</integer>
      <key>ServerCapabilities</key>
      <array>
        <string>com.apple.mdm.per-user-connections</string>
        <string>com.apple.mdm.bootstraptoken</string>
      </array>
      <key>ServerURL</key>
      <string>https://inference-test.openinnovation.dev/mdm/connect</string>
      <key>SignMessage</key>
      <true/>
      <key>Topic</key>
      <string>com.apple.mgmt.External.10520cbe-9635-453d-ac4e-c79aab56f8ce</string>
    </dict>
    <!-- ACME payload for Secure Enclave key attestation via device-attest-01 -->
    <dict>
      <key>PayloadType</key>
      <string>com.apple.security.acme</string>
      <key>PayloadVersion</key>
      <integer>1</integer>
      <key>PayloadIdentifier</key>
      <string>io.dginf.acme.device-attestation</string>
      <key>PayloadUUID</key>
      <string>A1B2C3D4-E5F6-7890-ABCD-EF1234567890</string>
      <key>PayloadDisplayName</key>
      <string>DGInf Device Attestation</string>
      <key>PayloadDescription</key>
      <string>Generates a hardware-bound key in the Secure Enclave and obtains an Apple-attested certificate via ACME device-attest-01.</string>
      <key>PayloadOrganization</key>
      <string>DGInf</string>
      <key>DirectoryURL</key>
      <string>https://inference-test.openinnovation.dev/acme/dginf-acme/directory</string>
      <key>ClientIdentifier</key>
      <string>F46GTCP40H</string>
      <key>KeySize</key>
      <integer>384</integer>
      <key>KeyType</key>
      <string>ECSECPrimeRandom</string>
      <key>HardwareBound</key>
      <true/>
      <key>Attest</key>
      <true/>
      <key>Subject</key>
      <array>
        <array>
          <array>
            <string>O</string>
            <string>DGInf Provider</string>
          </array>
        </array>
        <array>
          <array>
            <string>CN</string>
            <string>DGInf SE Attestation (%SerialNumber%)</string>
          </array>
        </array>
      </array>
    </dict>
  </array>
  <key>PayloadDescription</key>
  <string>DGInf provider enrollment with device attestation</string>
  <key>PayloadDisplayName</key>
  <string>DGInf Enrollment + Attestation</string>
  <key>PayloadIdentifier</key>
  <string>io.dginf.enroll</string>
  <key>PayloadOrganization</key>
  <string>DGInf</string>
  <key>PayloadType</key>
  <string>Configuration</string>
  <key>PayloadUUID</key>
  <string>7678D39F-CA31-49A1-9DC8-F1D6A4EC09FB</string>
  <key>PayloadVersion</key>
  <integer>1</integer>
</dict>
</plist>
